tap "oven-sh/bun"

brew "aria2"
brew "bat"
brew "btop"
brew "cmake"
brew "eza"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "jq"
brew "ncdu"
brew "neovim"
brew "node"
brew "oha"
brew "optipng"
brew "p7zip"
brew "pkgconf"
brew "ranger"
brew "rustup"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "oven-sh/bun/bun"

cask "cloudflare-warp"
cask "docker"
cask "ghostty"
cask "mongodb-compass"
cask "monitorcontrol"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
cask "zen"

vscode "aaron-bond.better-comments"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rubenverg.bootstrap-product-icons"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
