tap "anomalyco/tap"
tap "can1357/tap"
tap "oven-sh/bun", trusted: true
tap "tw93/tap", trusted: true
brew "aria2"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "sdl2-compat"
brew "ffmpeg"
brew "fzf"
brew "gdown"
brew "gh"
brew "git"
brew "gnupg"
brew "harfbuzz"
brew "herdr"
brew "lazygit"
brew "ncdu"
brew "neovim"
brew "node"
brew "nvm"
brew "oha"
brew "optipng"
brew "p7zip"
brew "pi-coding-agent"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "witr"
brew "yt-dlp"
brew "anomalyco/tap/opencode", trusted: true
brew "can1357/tap/omp", trusted: true
brew "oven-sh/bun/bun"
brew "tw93/tap/mole"
cask "aldente"
cask "antigravity"
cask "cloudflare-warp"
cask "cursor"
cask "fluidvoice"
cask "font-jetbrains-mono-nerd-font"
cask "intellij-idea"
cask "loom"
cask "monitorcontrol"
cask "orbstack"
cask "resilio-sync"
cask "stremio"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rubenverg.bootstrap-product-icons"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
