tap "homebrew/bundle"

brew "aria2"
brew "bat"
brew "btop"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "ncdu"
brew "neovim"
brew "node"
brew "p7zip"
brew "stow"
brew "tmux"
brew "yt-dlp"

cask "arc"
cask "cloudflare-warp"
cask "cursor"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
